/* (unsaved) */"(unsaved)" = "(未保存)";/* A newer version (%@) is available. Do you want to download it? in checkForUpdate */"A newer version (%@) is available. Do you want to download it?" = "新版本 (%@) 已经发布。 你确定要下载吗？";/* Advanced preferences toolbar item Label */"Advanced" = "高级";/* Advanced Find */"Advanced Find" = "高级查找";/* The name for the all documents project */"All documents" = "所有文件";/* Appearance preferences toolbar item Label */"Appearance" = "显示";/* Ask if you are sure that you want to delete %ld occurrences of %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */"Are you sure that you want to delete %ld occurrences of %@?" = "有 %1$i 项查找结果 “%2$@” 被找到，你确定要删除吗？";/* Ask if you are sure that you want to delete the one occurrence of %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */"Are you sure that you want to delete the one occurrence of %@?" = "有一项查找结果 “%@” 被找到，你确定要删除吗？";/* Ask if you are sure that you want to replace %ld occurrences of %@ with %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */"Are you sure that you want to replace %ld occurrences of %@ with %@?" = "你确定要将 %1$i 项查找结果 “%2$@” 替换为 “%3$@” 吗？";/* Ask if you are sure that you want to replace one occurrence of %@ with %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */"Are you sure that you want to replace one occurrence of %@ with %@?" = "你确定要将查找结果 “%1$@” 替换为 “%2$@” 吗？";/* Ask if you are sure you want to download preferences for Smultron from your iDisk and replace your current settings in Download-preferences-from-iDisk sheet */"Are you sure you want to download preferences for Smultron from your iDisk and replace your current settings?" = "你确定要从 iDisk 下载 Smultron 的偏好设定来替换现有的设定吗？";/* Ask if they are sure they want to install the command-line utility in Install-command-line-utility sheet */"Are you sure you want to install the command-line utility?" = "你确定要安装命令行工具吗？";/* Ask if you are sure you want to revert this document in Revert-sheet */"Are you sure you want to revert this document?" = "你确定要还原这份文件的修改吗？";/* Ask if you are sure you want to upload your current preferences for Smultron and replace the preference file on your iDisk (if it exists) in Upload-preferences-to-iDisk sheet */"Are you sure you want to upload your current preferences for Smultron and replace the preference file on your iDisk (if it exists)?" = "你确定要将目前的偏好设定上传到你的 iDisk 帐号吗？";/* Authenticate */"Authenticate" = "认证";/* The name for bytes in the info window */"bytes" = "bytes";/* Cancel-button */"Cancel" = "取消";/* Name for undo Change Encoding */"Change Encoding" = "改变文字编码";/* Name for undo Change Line Endings */"Change Line Endings" = "改变换行结尾";/* Indicate that they should change the preferences to a different encoding or be careful to check the content if you choose to open it in Check-encoding sheet */"Change the preferences to a different encoding or be careful to check the content if you choose to open it" = "请改变偏好设定中的文字编码设定，或者确定你要打开的文件内容文字编码是否正确";/* Indicate that they should choose something that is not a folder or change the settings in Preferences so that all items in a folder are opened in Open-file-is-a-directory sheet */"Choose something that is not a folder or change the settings in Preferences so that all items in a folder are opened" = "选择一个不是文件夹的文件，或是将偏好设定调整为主动打开文件夹内所有的文件";/* Close */"Close" = "关闭";/* Close Split */"Close Split" = "关闭分割窗口";/* Collection */"Collection" = "程序源码集合";/* Command ran successfully in runAction */"Command ran successfully" = "命令执行成功";/* Commands */"Commands" = "命令";/* The word to indicate that the filename is a copy in Save-A-Copy-As save-panel */"copy" = "复制";/* Indicate that you could not connect properly to your iDisk in Can't-connect-to-iDisk sheet */"Could not connect properly to your iDisk" = "无法正确的连接你的 iDisk 帐户";/* Could not find a match for search-string %@ in Advanced Find */"Could not find a match for search-string %@" = "无法找到符合的查找字串 “%@”";/* Indicate that a Smultron preference-file could not be found on your iDisk in Can't-find-iDisk-preferences-file sheet */"Could not find a Smultron preference-file on your iDisk" = "无法在你的 iDisk 帐户中找到 Smultron 的偏好设定文件";/* Indicate that the program could not find the syntax file to match this document in Could-not-find-syntax-file sheet */"Could not find the syntax file to match this document" = "无法找到适合这个文件的语法定义文件";/* Indicate that the local Preferences file could not be found in Can't-find-local-preferences-file sheet */"Could not find your local preferences file" = "无法在这台机器上找到你的偏好设定文件";/* Indicate that the program could not overwrite the file %@ because it has been removed in File-has-been-removed sheet */"Could not overwrite the file %@ because it has been removed" = "无法覆写 “%@”这个文件，因为他已经被移除了";/* Delete-button */"Delete" = "删除";/* Ask whether they want to ignore the updates the other application has made or reload the document and destroy any changes you have made to this document Document-has-been-updated-alert sheet */"Do you want to ignore the updates the other application has made or reload the document and destroy any changes you have made to this document?" = "你想要忽略其他程式对这个文件的改变，或是重新载入这个文件并放弃你之前的改变内容？";/* Ask whether they want to ignore the updates the other application has made or reload the document Document-has-been-updated-alert sheet */"Do you want to ignore the updates the other application has made or reload the document?" = "你要忽略由其他应用程式的内容更新，或重新载入这个文件吗？";/* Ask if you want to open %@ as a project or as a text file in Ask-if-project-or-file sheet */"Do you want to open %@ as a project or as a text file" = "你要以项目或是文本文件打开“%@” ";/* Don't Line Wrap Text */"Don't Line Wrap Text" = "不使用自动换行";/* Don't Save-button in Close-sheet */"Don't Save" = "不保存";/* Download */"Download" = "下载";/* Encoding, in the status bar */"Encoding" = "文字编码";/* Found %ld matches for search-string %@ in Advanced Find */"Found %ld matches for search-string %@" = "找到 %1$i 项查找结果 “%2$@”";/* Found one match for search-string %@ in Advanced Find */"Found one match for search-string %@" = "找到一项查找结果符合 “%@”";/* Function */"Function" = "函数";/* General preferences toolbar item Label */"General" = "一般";/* Hide Documents List in View menu */"Hide Documents List" = "隐藏文件列表";/* Hide Invisible Characters in View-menu */"Hide Invisible Characters" = "隐藏不可见的字体";/* Hide Line Numbers */"Hide Line Numbers" = "隐藏行号";/* Hide Projects toolbar item Label */"Hide Projects" = "隐藏项目";/* Hide Projects Drawer in View menu */"Hide Projects Drawer" = "隐藏项目抽屉";/* Hide Status Bar in View-menu */"Hide Status Bar" = "隐藏状态列";/* Hide Syntax Colours */"Hide Syntax Colours" = "隐藏语法颜色";/* Hide Tab Bar in View menu */"Hide Tab Bar" = "隐藏标签列";/* Indicate that if you choose Install smultron will be installed in /usr/bin and its man page in /usr/share/man/man1 and you can use it directly in the Terminal (you may need to authenticate twice with an administrators username and password). Otherwise you can choose to place all the files you need on the desktop and install it manually. in Install-command-line-utility sheet */"If you choose Install smultron will be installed in /usr/bin and its man page in /usr/share/man/man1 and you can use it directly in the Terminal (you may need to authenticate twice with an administrators username and password). Otherwise you can choose to place all the files you need on the Desktop and install it manually." = "如果你选择安装， Smultron会将他安装到 /usr/bin ，而说明文件将被安装到 /usr/share/man/man1 ，你可以直接在终端窗口中使用他（你需要输入两次你的管理员用户名与密码来确认安装）。或者你可以选择将文件放置在桌面上，然后手动安装。";/* Indicate that if you want you can try to authenticate with an administrators username and password */"If you want you can try to authenticate with an administrators username and password" = "请确认管理员用户名与密码";/* Ignore-button in Document-has-been-updated-alert sheet */"Ignore" = "忽略";/* The name for the collection that holds the snippets that are imported from version 1 */"Imported Snippets" = "导入程序源码片段";/* Info */"Info" = "简介";/* Install-button in Install-command-line-utility sheet */"Install" = "安装";/* Indicate that it seems as if you do not have permission to open the file %@ in Not-enough-permission-to-open sheet */"It seems as if you do not have permission to open the file %@" = "你并未拥有打开“%@”文件的权限";/* Indicate that it seems as if you do not have permission to save the file %@ in Not-enough-permission-in-data-save sheet */"It seems as if you do not have permission to save the file %@" = "你并未拥有保存“%@”文件的权限";/* Saved, in the status bar */"Saved" = "已保存";/* Length, in the status bar */"Length" = "文件长度";/* Line Wrap Text */"Line Wrap Text" = "自动换行";/* Line Wrap / Don't Line Wrap toolbar item Palette Label */"Line Wrap / Don't Line Wrap" = "自动换行 / 不使用自动换行";/* Live Find */"Live Find" = "即时查找";/* Indicate that they should Make sure that your .Mac settings are correct and you are connected to the internet */"Make sure that your .Mac settings are correct and you are connected to the internet" = "请确定你的 .Mac 设定正确，并且你的电脑有正确的连接上 internet";/* New */"New" = "新建";/* Indicate that no document is selected for the dummy view */"No document selected" = "没有被选择的文件";/* Not applicable in insertAllFunctionsIntoMenu */"Not applicable" = "没有可用的函数";/* OK-button */"OK" = "OK";/* The name for the collection that holds the old snippets that are imported from version 1 */"Old Snippets" = "旧的程序源码片段";/* Open */"Open" = "打开";/* OpenSave preferences toolbar item Label */"Open & Save" = "打开与保存";/* Please be patient. It could take a while. in preparing to print */"Please be patient. It could take a while." = "这可能要花点时间，请保持耐心。";/* Indicate that they should please change the preferences if you want any information in the bar in Show-status-bar-action */"Please change the preferences if you want any information in the bar" = "请在偏好设定中设定你要在状态栏中显示的信息";/* Indicate that they should please check if you've moved or deleted the original file in Revert-file-doesn't-exist sheet */"Please check if you've moved or deleted the original file" = "请检查你是否移动或删除了原始文件";/* Indicate that they should please check the installation of Smultron and that they have a preference-file at <your home folder>/Library/Preferences/org.smultron.Smultron.plist in Can't-find-local-preferences-file sheet */"Please check the installation of Smultron and that you have a preference-file at <your home folder>/Library/Preferences/org.smultron.Smultron.plist" = "请检查 Smultron 的安装状态，你的偏好设定文件会被放置在 <你的用户文件夹>/资源库/Preferences/org.smultron.Smultron.plist";/* Indicate that they should Please check the installation of the application and the preferences in Could-not-find-syntax-file sheet */"Please check the installation of the application and the preferences" = "请检查应用程式的安装记录和偏好设定";/* Indicate that they should please check the permissions for the file and the enclosing folder and try again in Unknown-error-when-opening-with-authentication sheet */"Please check the permissions for the file and the enclosing folder and try again" = "请检查文件的权限，关闭文件夹再试一次";/* Please consider exporting the snippets first. There is no undo available. when deleting a collection */"Please consider exporting the snippets first. There is no undo available." = "请先导出程序源码片段。这个步骤不可还原。";/* Indicate that they should find it at different location by choosing Open%C in the File menu Open-file-does-not-exist sheet */"Please find it at a different location by choosing Open%C in the File menu" = "请使用文件菜单中的打开 %C 在其他位置中查找这个文件";/* Indicate that they should please make sure that they have a file called org.smultron.Smultron.plist in the folder /Documents/Smultron Preferences on their iDisk and that their .Mac settings are correct and that they are connected to the internet in Can't-find-iDisk-preferences-file sheet */"Please make sure that you have a file called org.smultron.Smultron.plist in the folder /Documents/Smultron Preferences/ on your iDisk and that your .Mac settings are correct and that you are connected to the internet" = "请检查在你的 iDisk 帐号的 /Documents/Smultron Preferences/ 是否有 org.smultron.Smultron.plist 这个文件，并确定你的 .Mac 设定正确，而且你的电脑有正确的连接上 internet";/* Indicate that they should make sure that their .Mac settings are correct and that they are connected to the internet in Can't-connect-to-iDisk sheet */"Please make sure that your .Mac settings are correct and that you are connected to the internet" = "请确定你的 .Mac 设定正确，并且你的电脑有正确的连接上 internet";/* Indicate that they should try to save in a different location */"Please save it at a different location" = "请保存在其他位置";/* Indicate that they should try to save at a different location with Save As%C in File menu in Path-is-a-directory sheet */"Please save it at a different location with Save As%C in the File menu" = "请用文件菜单中的 保存为 %C 保存到其他位置";/* Indicate that you should try a different location with Save As%C in the File menu in Unknown-error-when-saving-with-authentication sheet */"Please try a different location with Save As%C in the File menu" = "请尝试文件菜单中的 保存为 %C 保存到其他位置";/* Indicate that you should try a different location with Save As%C in the File menu or check the permissions of the file and the enclosing folder and try again in Unknown-error-when-saving sheet */"Please try a different location with Save As%C in the File menu or check the permissions of the file and the enclosing folder and try again" = "请尝试文件菜单中的 保存为 %C 保存到其他位置，或确认文件的权限，关闭文件夹再试一次";/* Indicate that they should try to save in a different location with in Unknown-error-when-data-saving sheet */"Please try to save in a different location" = "请尝试保存在不同的位置";/* Indicate that they should please use Save As%C in the File menu in File-has-been-removed sheet */"Please use Save As%C in the File menu" = "请使用文件菜单中的 保存为 %C";/* Position, in the status bar */"Position" = "光标位置";/* Preferences */"Preferences" = "偏好设定";/* Preparing the document for printing in preparing to print */"Preparing the document for printing" = "准备打印文件";/* Press the Escape-button on the keyboard to return from the full screen mode in Show Document In Full Screen */"Press the Escape-button on the keyboard to return from the full screen mode" = "按下 ESC 键离开全荧幕模式";/* Preview */"Preview" = "预览";/* Project-button in Ask-if-project-or-file sheet */"Project" = "项目";/* Put On Desktop-button in Install-command-line-utility sheet */"Put On Desktop" = "显示在桌面";/* Reload-button in Document-has-been-updated-alert sheet */"Reload" = "重新载入";/* Remember that you can always Undo any changes in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */"Remember that you can always Undo any changes" = "请记得，你永远可以还原任何改变";/* Replace-button in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */"Replace" = "替换";/* Indicate that we replaced %ld occurrences of %@ with %@ in update-search-textField-after-replace */"Replaced %ld occurrences of %@ with %@" = "发现 %1$i 项 “%2$@” ，并替换为 “%3$@”";/* Indicate that we replaced one occurrence of %@ with %@ in update-search-textField-after-replace */"Replaced one occurrence of %@ with %@" = "发现一项 “%1$@” ，并替换为“%2$@”";/* Revert-button in Revert-sheet */"Revert" = "还原";/* Save */"Save" = "保存";/* Selection, in the status bar */"Selection" = "选取文字";/* Show Documents List in View menu */"Show Documents List" = "显示文件列表";/* Show Invisible Characters in View-menu */"Show Invisible Characters" = "显示不可见的字体";/* Show Line Numbers */"Show Line Numbers" = "显示行号";/* Show Projects toolbar item Label */"Show Projects" = "显示项目";/* Show Projects Drawer in View menu */"Show Projects Drawer" = "显示项目抽屉";/* Show Status Bar in View-menu */"Show Status Bar" = "显示状态栏";/* Show Syntax Colours */"Show Syntax Colours" = "显示语法颜色";/* Show Tab Bar in View menu */"Show Tab Bar" = "显示标签栏";/* Show/Hide Line Numbers toolbar item Palette Label */"Show/Hide Line Numbers" = "显示/隐藏行号";/* Show/Hide Projects toolbar item Palette Label */"Show/Hide Projects" = "显示/隐藏行号";/* Show/Hide Syntax Colours toolbar item Palette Label */"Show/Hide Syntax Colours" = "显示/隐藏语法颜色";/* Snippets */"Snippets" = "程序源码片段";/* Split Window */"Split Window" = "分割窗口";/* Split Window / Close Split toolbar item Palette Label */"Split Window / Close Split" = "分割窗口 / 关闭分割窗口";/* Syntax, in the status bar */"Syntax" = "语法";/* Syntax colours preferences toolbar item Label */"Syntax Colours" = "语法颜色";/* Syntax definitions preferences toolbar item Label */"Syntax Definitions" = "语法定义";/* Text File-button in Ask-if-project-or-file sheet */"Text File" = "文本文件";/* Indicate that the document %@ has been updated by another application in Document-has-been-updated-alert sheet */"The document %@ has been updated by another application" = "文件 “%@” 被其他应用程式更新了";/* Indicate in Close-sheet that the document %@ has not been saved. */"The document %@ has not been saved" = "文件 “%@” 尚未保存";/* Indicate that the document %@ is no longer open in Document-is-no-longer-opened-after-selection-in-advanced-find-sheet */"The document %@ is no longer open" = "文件 “%@” 并未打开";/* Indicate that the file %@ does not exist Open-file-does-not-exist sheet */"The file %@ does not exist" = "文件 “%@” 并不存在";/* Indicate that there was a problem opening the document with the encoding %@. And ask if you want to open it anyway? */"There was a problem opening the document with the encoding %@. Do you want to try to open it anyway?" = "使用“%@”编码打开文件时发生错误。你确定还要打开吗？";/* Indicate that there was a unknown error when trying to install the command-linbe utility in Unknown-error-when-installing-comman-line-utility sheet */"There was a unknown error when trying to install the command-line utility" = "在安装命令行工具时发生了未知的错误";/* Indicate that there was a unknown error when trying to open the file %@ with authentication in Unknown-error-when-opening-with-authentication sheet */"There was a unknown error when trying to open the file %@ with authentication" = "在打开“%@”文件验证时发生了未知的错误";/* Indicate that there was a unknown error when trying to save the file %@ in Unknown-error-when-saving sheet */"There was a unknown error when trying to save the file %@" = "在保存“%@”文件时发生了未知的错误";/* Indicate that there was a unknown error when trying to save the file %@ with authentication in Unknown-error-when-saving-with-authentication sheet */"There was a unknown error when trying to save the file %@ with authentication" = "在保存 “%@”文件验证时发生了未知的错误";/* This message will NOT appear again so try to remember it:-) in Show Document In Full Screen */"This message will NOT appear again so try to remember it:-)" = "这个讯息不会再度出现，请牢记他:-)";/* This will delete all snippets that exists in the collection %@. Are you sure you want to continue? when deleting a collection */"This will delete all snippets that exists in the collection %@. Are you sure you want to continue?" = "这会删除 “%@”程序源码集合内的所有程序源码片段。 你确定要继续吗？";/* Unknown error when running the command in performCommand */"Unknown error when running the command" = "未知的错误导致命令行执行失败";/* Name for untitled document */"untitled" = "未命名";/* Untitled project */"Untitled project" = "未命名的项目";/* Upload-button in Upload-preferences-to-iDisk sheet */"Upload" = "上传";/* Use settings from Preferences in openAction */"Use settings from Preferences" = "使用偏好设定值";/* Indicate that you can not save this file because %@ is now a folder */"You can not save this file because %@ is now a folder" = "你无法把文件保存为 “%@” ，因为他是个文件夹";/* Indicate that you cannot open %@ because it is a folder in Open-file-is-a-directory sheet */"You cannot open %@ because it is a folder" = "你无法打开 “%@” ，因为他是个文件夹";/* Indicate that you cannot revert this document because the file %@ doesn't exist anymore Revert-file-doesn't-exist sheet */"You cannot revert this document because the file %@ doesn't exist anymore" = "你无法复原文件，因为文件 “%@” 并不存在";/* Indicate that they have set the preferences to not show anything in the status bar in Show-status-bar-action */"You have set the preferences to not show anything in the status bar" = "已经设定为空白的状态栏";/* You need Mac OS X 10.4.5 Tiger or later to run this version of Smultron in Check-system-version */"You need Mac OS X 10.4.5 Tiger or later to run this version of Smultron" = "你需要在 Mac OS X 10.4.5 Tiger 或更高的版本中运行 Smultron";/* Your changes will be lost if you close the document without saving in Close-sheet */"Your changes will be lost if you close the document without saving." = "如果你不保存就关闭这个文件，现时所有的内容更改都会掉失。";/* Warn that changes will be lost if you revert in Revert-sheet */"Your changes will be lost if you revert the document" = "如果你选择复原文件，现时所有的内容更改都会掉失。";